cask_args appdir: "/Applications"
  
tap "homebrew/bundle"
tap "homebrew/core"
tap "d12frosted/emacs-plus"
tap "AdoptOpenJDK/openjdk"
tap "d12frosted/emacs-plus"

brew "git"
brew "ripgrep"
brew "vim"
brew "zsh"
brew "zsh-completions"
brew "docker"
brew "pyenv"
brew "rbenv"
brew "go"
brew "elixir"
brew "sbt"
brew "peco"
brew "usbmuxd"
brew "libimobiledevice"
brew "ideviceinstaller"
brew "ios-deploy"
brew "cocoapods"
brew "roswell"
brew "lazygit"
brew "starship"
brew "ispell"
brew "aspell"
brew "carthage"
brew "emacs-plus", args: ["HEAD", "with-jansson", "with-no-titlebar"]

cask "google-chrome"
cask "slack"
cask "iterm2"
cask "jetbrains-toolbox"
cask "docker"
cask "postman"
cask "karabiner-elements"
cask "alfred"
cask "zeplin"
cask "abstract"
cask "google-japanese-ime"
cask "hyperswitch"
cask "scroll-reverser"
cask "station"
cask "adoptopenjdk8"
cask "1password"
